; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	image1 - mode
	spectrograph0 - mode
	GroundStation3 - direction
	Star6 - direction
	GroundStation9 - direction
	Star8 - direction
	Star11 - direction
	GroundStation1 - direction
	Star10 - direction
	GroundStation5 - direction
	Star0 - direction
	Star7 - direction
	Star2 - direction
	GroundStation4 - direction
	Star12 - direction
	Phenomenon13 - direction
	Star14 - direction
	Star15 - direction
	Planet16 - direction
	Star17 - direction
	Planet18 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(supports instrument0 image1)
	(calibration_target instrument0 Star7)
	(calibration_target instrument0 Star8)
	(calibration_target instrument0 Star0)
	(supports instrument1 image1)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 GroundStation5)
	(calibration_target instrument1 Star10)
	(calibration_target instrument1 GroundStation1)
	(calibration_target instrument1 Star11)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star10)
	(supports instrument2 spectrograph0)
	(supports instrument2 image1)
	(calibration_target instrument2 GroundStation4)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star0)
	(supports instrument3 image1)
	(supports instrument3 spectrograph0)
	(calibration_target instrument3 GroundStation4)
	(calibration_target instrument3 Star2)
	(calibration_target instrument3 Star7)
	(calibration_target instrument3 Star0)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet18)
)
(:goal (and
	(pointing satellite1 Star15)
	(have_image Star12 spectrograph0)
	(have_image Phenomenon13 spectrograph0)
	(have_image Star14 image1)
	(have_image Star15 spectrograph0)
	(have_image Planet16 spectrograph0)
	(have_image Star17 spectrograph0)
	(have_image Planet18 image1)
))

)

; plan
1. (turn_to satellite1 star15 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 star15)
   goals met: 1 of 8
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 1 of 8
3. (calibrate satellite0 instrument1 star10)
   added: (calibrated instrument1)
   goals met: 1 of 8
4. (turn_to satellite0 planet18 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 planet18)
   goals met: 1 of 8
5. (take_image satellite0 planet18 instrument1 image1)
   added: (have_image planet18 image1)
   goals met: 2 of 8
6. (turn_to satellite0 planet16 planet18)
   deleted: (pointing satellite0 planet18)
   added: (pointing satellite0 planet16)
   goals met: 2 of 8
7. (take_image satellite0 planet16 instrument1 spectrograph0)
   added: (have_image planet16 spectrograph0)
   goals met: 3 of 8
8. (turn_to satellite0 phenomenon13 planet16)
   deleted: (pointing satellite0 planet16)
   added: (pointing satellite0 phenomenon13)
   goals met: 3 of 8
9. (take_image satellite0 phenomenon13 instrument1 spectrograph0)
   added: (have_image phenomenon13 spectrograph0)
   goals met: 4 of 8
10. (turn_to satellite0 star12 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 star12)
   goals met: 4 of 8
11. (take_image satellite0 star12 instrument1 spectrograph0)
   added: (have_image star12 spectrograph0)
   goals met: 5 of 8
12. (turn_to satellite0 star14 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star14)
   goals met: 5 of 8
13. (take_image satellite0 star14 instrument1 image1)
   added: (have_image star14 image1)
   goals met: 6 of 8
14. (turn_to satellite0 star15 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 star15)
   goals met: 6 of 8
15. (take_image satellite0 star15 instrument1 spectrograph0)
   added: (have_image star15 spectrograph0)
   goals met: 7 of 8
16. (turn_to satellite0 star17 star15)
   deleted: (pointing satellite0 star15)
   added: (pointing satellite0 star17)
   goals met: 7 of 8
17. (take_image satellite0 star17 instrument1 spectrograph0)
   added: (have_image star17 spectrograph0)
   goals met: 8 of 8
